data/google/gke/gpu/16/node-0/raw/sysbench-fileio-run-file-test-modeseqwr
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 1
Initializing random number generator from current time


Extra file open flags: (none)
128 files, 16MiB each
2GiB total file size
Block size 16KiB
Periodic FSYNC enabled, calling fsync() each 100 requests.
Calling fsync() at the end of test, Enabled.
Using synchronous I/O mode
Doing sequential write (creation) test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      0.00
    writes/s:                     9341.45
    fsyncs/s:                     11966.25

Throughput:
    read, MiB/s:                  0.00
    written, MiB/s:               145.96

General statistics:
    total time:                          10.0075s
    total number of events:              213144

Latency (ms):
         min:                                    0.01
         avg:                                    0.05
         max:                                   24.39
         95th percentile:                        0.05
         sum:                                 9954.15

Threads fairness:
    events (avg/stddev):           213144.0000/0.00
    execution time (avg/stddev):   9.9542/0.00